app/controllers/vacancies_controller.rb

SELECT "vacancies".* FROM "vacancies"
---
  def index
    @vacancies = Vacancy.all

INSERT INTO "vacancies" ("email", "position", "workPlace", "workingStatus", "description", "contactphone", "companyInfo", "deadlinedate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vacancy = Vacancy.new(vacancy_params)
    @vacancy.save

SELECT  "vacancies".* FROM "vacancies" WHERE "vacancies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_vacancy
      @vacancy = Vacancy.find(params[:id])